app/controllers/posts_controller.rb

  def create
  	@post = current_user.posts.build(post_params)
  	if @post.save
---
INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["title", "1"], ["body", "as tou"], ["created_at", "2017-10-20 08:10:26.508453"], ["updated_at", "2017-10-20 08:10:26.508453"]]

  def update
  	@post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "000111111"], ["updated_at", "2017-10-20 11:24:32.995438"], ["id", 4]]